Revit 2027 API
BuiltInFailures.FamilyFailures.NotFamilyFile Property
 The selected file is not a Family File.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotFamilyFile { get; }
Public Shared ReadOnly Property NotFamilyFile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotFamilyFile {
	FailureDefinitionId^ get ();
}
static member NotFamilyFile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace